app/controllers/microposts_controller.rb

  def index
    @microposts = Micropost.all
---
SELECT `microposts`.* FROM `microposts`

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO `microposts` (`content`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('First Microposts', 'hi', 1, '2014-12-17 20:17:25.406265', '2014-12-17 20:17:25.406265')

  def destroy
    @micropost.destroy
---
DELETE FROM `microposts` WHERE `microposts`.`id` = 2

    def set_micropost
      @micropost = Micropost.find(params[:id])
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 2 LIMIT 1