app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Abner A Benavides', 'abnerb86@gmail.com', '$2a$10$U53xDsv3GD3oIR6iOSYSJeLmGI40C842yiEJasEg4As6p4Vg6qSDW', '2014-12-20 22:35:26.729138', '2014-12-20 22:35:26.729138')